{
  "basics": {
    "name": "Seth Michael Stalley",
    "label": "Software Developer",
    "picture": "https://sethstalley.com/assets/images/profile.jpg",
    "email": "sethstalley@gmail.com",
    "phone": "+506 83011931",
    "website": "https://sethstalley.com",
    "summary": "Hi there! I'm a software engineer and U.S. expatriate who currently lives in Costa Rica.",
    "location": {
      "countryCode": "CR"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "sethstalley",
        "url": "https://twitter.com/sethstalley"
      }
    ]
  },
  "work": [
    {
      "company": "Microsoft",
      "position": "Software Engineer II",
      "startDate": "2021-03-15",
      "summary": "Built big data analytics pipeline for Teams backend and improved devops processes within the wider team.",
      "highlights": [
        "Built regionalized data analytics pipeline using Spark and Azure Synapse. The pipeline provides insight into provisioned Microsoft Teams customers. The pipeline processes billions of rows and considers data boundary and data privacy concerns.",
        "Wrote custom orchestrator/job which runs Dependabot inside our Azure Dev Ops organization. Dependabot helps maintain the Nuget packages of over 400 git repositories. To date, dependabot has submitted over 1k pull requests with dependency update recommendations.",
        "Leading a multi-dev project to improve deployment processes for services within our wider team. To date we have simplified builds, collected unified quality metrics, and reduced the manual steps required to deploy services to production."
      ]
    },
    {
      "company": "Amazon",
      "position": "Software Development Engineer I & II",
      "startDate": "2019-03-01",
      "endDate": "2021-03-12",
      "summary": "Built self service and automation solutions for Amazon's Selling Partners.",
      "highlights": [
        "Built cross service automation workflows aimed at increasing the automation of internal processes and providing self service solutions to Amazon Sellers. Up to ~85% reduction in human handled support cases for certain scenarios.",
        "Improved developer onboarding of team's services. Reduced onboarding time for some services from hours to minutes.",
        "Championed team's shift to building infrastructure as code through the use of AWS CDK.",
        "Actively lead the deprecation of a legacy internal service with 13 client applications - 4 clients remain.",
        "Was promoted from SDE I to SDE II in ~19 months - which is above average for Amazon."
      ]
    },
    {
      "company": "simMachines",
      "position": "Software Engineer and Data Analyst",
      "startDate": "2018-07-09",
      "endDate": "2019-03-01",
      "summary": "Worked as a full stack software engineer at a fast paced machine learning startup.",
      "highlights": [
        "Leader in company's transition to an automated CI/CD processes. Products are now built and deployed in minutes instead of days.",
        "Integral designer and developer of full stack A/B Testing project. The product uses proprietary Machine Learning models to explain the 'Why' behind customer's preferences."
      ]
    },
    {
      "company": "Amazon",
      "position": "Software Development Engineer - Intern",
      "startDate": "2017-07-24",
      "endDate": "2017-11-25",
      "summary": "Created internal Java microservice that allows internal applications to easily communicate with Amazon's email service.",
      "highlights": [
        "Greatly simplified the existing solution that was being used to send emails from internal IT applications.",
        "Leveraged AWS SNS and SQS to create a highly portable and scalable service.",
        "Created internal documentation and metrics dashboards.",
        "Setup near real-time logs and alarms using AWS CloudWatch.",
        "After the internship, I was greenlit by the bar raiser and team to be hired as a full time SDE at Amazon."
      ]
    }
  ],
  "volunteer": [{
    "organization": "ITCR's Chemistry School",
    "position": "Assistant",
    "startDate": "2016-08-27",
    "endDate": "2017-01-13",
    "summary": "Assisted with the development of a cross-platform Java Swing application with the goal of processing data from a spectrophotometer.",
    "highlights": [
      "Implemented encrypted file Save/Open feature for Java desktop application.",
      "Created a REST API using Node.js to securely expose MySQL procedures over HTTPS.",
      "Created complementary web app using polymer, which displays real time data from REST API and graphs data using highcharts."
    ]
  }],
  "education": [
    {
      "institution": "Costa Rica Institute of Technology",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2014-02-12",
      "endDate": "2018-03-09",
      "gpa": "3.6"
    }
  ],

  "skills": [
    {
      "name": "Backend",
      "level": "Intermediate",
      "keywords": [
        "Java/Scala",
        "Python",
        "Node Express",
        "Ruby Rails",
        "Serverless",
        "In memory DB",
        "SQL",
        "NoSQL"
      ]
    },
    {
      "name": "Cloud",
      "level": "Intermediate",
      "keywords": [
        "AWS",
        "Azure",
        "Firebase"
      ]
    },
    {
      "name": "DevOps",
      "level": "Intermediate",
      "keywords": [
        "CircleCI",
        "AWS Cloudformation",
        "AWS Code Deploy",
        "Azure Dev Ops",
        "Azure Resource manager",
        "Gulp",
        "Docker",
        "Github",
        "Github Actions"
      ]
    },
    {
      "name": "Web Development",
      "level": "Intermediate",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript/TypeScript",
        "Hugo/Jekyll",
        "Electron"
      ]
    },
    {
      "name": "Video Game Development",
      "level": "Novice",
      "keywords": [
        "Unity Engine - C#",
        "PixiJS"
      ]
    },
    {
      "name": "Mobile",
      "level": "Novice",
      "keywords": [
        "Android Studio",
        "React Native",
        "Flutter"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Fluent"
    }
  ]
}
